# AltaML Technical Task

In this notebook, we will be exploring the problem given by AltaML and answer some of the questions provided. Let us first begin by creating a cell to import all the packages that will be used in this project:

In [2]:
import numpy as np
import pandas as pd

Let's take a first look at the data:

In [9]:
# Import data and show the first 5 rows
data = pd.read_csv('dataset.csv')
data.head()

,id,water,uv,area,fertilizer_usage,yield,pesticides,region,categories
0,169,5.615,65.281,3.230,0,7.977,8.969,0,"b,a,c"
1,476,7.044,73.319,9.081,0,23.009,7.197,0,"c,a,d"
2,152,5.607,60.038,2.864,2,23.019,7.424,0,"d,a"
3,293,9.346,64.719,2.797,2,28.066,1.256,0,d
4,10,7.969,NaN,5.407,1,29.140,0.274,0,"c,d"

In [11]:
# Let's peek at some summary statistics
data.describe()

,id,water,uv,area,fertilizer_usage,yield,pesticides,region
count,1000.000000,958.000000,949.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,499.500000,12.223546,73.957488,8.098848,2.12300,58.758571,3.452301,3.039000
std,288.819436,172.335566,9.904063,2.692632,1.52256,24.563683,2.076921,1.883886
min,0.000000,0.072000,45.264000,0.263000,0.00000,2.843000,0.014000,0.000000
25%,249.750000,4.584750,66.502000,6.297000,1.00000,40.698000,1.804500,2.000000
50%,499.500000,6.476000,73.689000,7.987500,2.00000,55.602500,3.275500,2.000000
75%,749.250000,8.758750,80.554000,9.900250,3.00000,73.645500,4.916000,5.000000
max,999.000000,5340.000000,106.310000,18.311000,5.00000,148.845000,9.532000,6.000000

In [12]:
# Lets check the types
data.dtypes

id                    int64
water               float64
uv                  float64
area                float64
fertilizer_usage      int64
yield               float64
pesticides          float64
region                int64
categories           object
dtype: object

In order for the categories (pesticides) column to be useful, we can split each category into a unique column containing binary values indicating whether or not the observating is in each of the categories:

In [17]:
# Test a single observation first
data.loc[0,'categories'].split(',')

['b', 'a', 'c']

In [19]:
# Split every category into a list based on commas via list comprehension
data['categories2'] = [x.split(',') for x in data.loc[:,'categories']]

In [21]:
# Sanity check
data.loc[:10, ['categories', 'categories2']]

   categories   categories2
0       b,a,c     [b, a, c]
1       c,a,d     [c, a, d]
2         d,a        [d, a]
3           d           [d]
4         c,d        [c, d]
5           b           [b]
6     b,c,a,d  [b, c, a, d]
7     a,c,b,d  [a, c, b, d]
8         c,b        [c, b]
9       d,b,c     [d, b, c]
10      b,c,a     [b, c, a]

Now that we have all of the categories in a clean list, we can create dummy variables and populate them with the binary 1\/0 values mentioned above

In [23]:
# Find all unique values in categories2
allvals = []
for x in data['categories2'].values:
    allvals += x
set(allvals)

{'a', 'b', 'c', 'd'}

In [27]:
dummies = pd.DataFrame([np.nan]*4).T
dummies.columns = ['cat_a', 'cat_b', 'cat_c', 'cat_d']

   cat_a  cat_b  cat_c  cat_d
0    NaN    NaN    NaN    NaN

In [38]:
# Try one value first
pd.Series(['a', 'b', 'c', 'd']).isin(data.loc[0,'categories2']).values * 1

array([1, 1, 1, 0])

In [36]:
# Sanity check, d should be the only category missing
data.loc[0,'categories2']

['b', 'a', 'c']

In [39]:
cat_vector = [pd.Series(['a', 'b', 'c', 'd']).isin(x).values * 1 for x in data['categories2']]

In [42]:
vector[:5]

[array([1, 1, 1, 0]),
 array([1, 0, 1, 1]),
 array([1, 0, 0, 1]),
 array([0, 0, 0, 1]),
 array([0, 0, 1, 1])]

In [47]:
vector_df = pd.DataFrame(vector, columns = ['cat_a', 'cat_b', 'cat_c', 'cat_d'])
vector_df

     cat_a  cat_b  cat_c  cat_d
0        1      1      1      0
1        1      0      1      1
2        1      0      0      1
3        0      0      0      1
4        0      0      1      1
..     ...    ...    ...    ...
995      0      1      1      0
996      0      1      1      1
997      1      1      1      0
998      1      0      0      0
999      1      0      0      0

[1000 rows x 4 columns]

In [54]:
# Add to our original dataframe
data2 = pd.concat([data, vector_df], axis=1)

# Remove the old categories columns now that we don't need them
data2 = data2.drop(['categories', 'categories2'], axis=1)

In [55]:
data2.head()

,id,water,uv,area,fertilizer_usage,yield,pesticides,region,cat_a,cat_b,cat_c,cat_d
0,169,5.615,65.281,3.230,0,7.977,8.969,0,1,1,1,0
1,476,7.044,73.319,9.081,0,23.009,7.197,0,1,0,1,1
2,152,5.607,60.038,2.864,2,23.019,7.424,0,1,0,0,1
3,293,9.346,64.719,2.797,2,28.066,1.256,0,0,0,0,1
4,10,7.969,NaN,5.407,1,29.140,0.274,0,0,0,1,1